import React, { FC } from 'react';

import Section from '@/components/Section/Section';
import Heading from '@/components/Heading/Heading';
import Paragraph from '@/components/Parapgaph/Paragraph';
import { TournamentBlock } from '@/components/TournamentBlock';

import data from '@/data/tournaments.json';
import img1 from '@/public/images/tournaments/tournament-1.png';

const tournaments = [
  {
    imgUrl: img1,
    title: 'Black Sea Cup – весна',
    type: 'Командний турнір',
    playersInTeam: 2,
    description:
      'Один із найяскравіших і найтепліших турнірів, який зазвичай проводять на березі Чорного моря. У турнірі можуть взяти участь від 15 до 30 команд, \nу кожній по 4 особи. \n\nДень №1 - проходить 4 відбіркові тури, де гравці розсаджуються випадковим чином. Потім відбувається фінальна гра з особистого заліку.День №2 - проходить одна півфінальна гра між командами, які посіли перші 15 місць, за результатами якої визначається 10 команд фіналістів. Вони грають фінальну гру одночасно, за чотирма столами, де гравці, які набрали найбільшу кількість очок, гратимуть між собою.',
  },
  {
    imgUrl: img1,
    title: 'Black Sea Cup – весна',
    type: 'Командний турнір',
    playersInTeam: 2,
    description:
      'Один із найяскравіших і найтепліших турнірів, який зазвичай проводять на березі Чорного моря. У турнірі можуть взяти участь від 15 до 30 команд, \nу кожній по 4 особи. \n\nДень №1 - проходить 4 відбіркові тури, де гравці розсаджуються випадковим чином. Потім відбувається фінальна гра з особистого заліку.День №2 - проходить одна півфінальна гра між командами, які посіли перші 15 місць, за результатами якої визначається 10 команд фіналістів. Вони грають фінальну гру одночасно, за чотирма столами, де гравці, які набрали найбільшу кількість очок, гратимуть між собою.',
  },
  {
    imgUrl: img1,
    title: 'Black Sea Cup – весна',
    type: 'Командний турнір',
    playersInTeam: 2,
    description:
      'Один із найяскравіших і найтепліших турнірів, який зазвичай проводять на березі Чорного моря. У турнірі можуть взяти участь від 15 до 30 команд, \nу кожній по 4 особи. \n\nДень №1 - проходить 4 відбіркові тури, де гравці розсаджуються випадковим чином. Потім відбувається фінальна гра з особистого заліку.День №2 - проходить одна півфінальна гра між командами, які посіли перші 15 місць, за результатами якої визначається 10 команд фіналістів. Вони грають фінальну гру одночасно, за чотирма столами, де гравці, які набрали найбільшу кількість очок, гратимуть між собою.',
  },
];

export const Tournaments: FC = () => {
  const { title, text } = data;

  return (
    <Section className="pb-0">
      <div className="container mb-[78px] md:mb-[60px]">
        <Heading className="mb-6" shadow={title}>
          {title}
        </Heading>
        <Paragraph className="text-base">{text}</Paragraph>
      </div>
      {tournaments.map((tournament, index) => (
        <TournamentBlock key={index} tournament={tournament} />
      ))}
    </Section>
  );
};
